MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1769/mcu.h
// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x114);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C2SYNC                 :1;
        unsigned C2HYS                  :1;
        unsigned C2SP                   :1;
        unsigned C2ZLF                  :1;
        unsigned C2POL                  :1;
        unsigned                        :1;
        unsigned C2OUT                  :1;
        unsigned C2ON                   :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x114);
// bitfield macros
#define _CM2CON0_SYNC_POSN                                  0x0
#define _CM2CON0_SYNC_POSITION                              0x0
#define _CM2CON0_SYNC_SIZE                                  0x1
#define _CM2CON0_SYNC_LENGTH                                0x1
#define _CM2CON0_SYNC_MASK                                  0x1
#define _CM2CON0_HYS_POSN                                   0x1
#define _CM2CON0_HYS_POSITION                               0x1
#define _CM2CON0_HYS_SIZE                                   0x1
#define _CM2CON0_HYS_LENGTH                                 0x1
#define _CM2CON0_HYS_MASK                                   0x2
#define _CM2CON0_ZLF_POSN                                   0x3
#define _CM2CON0_ZLF_POSITION                               0x3
#define _CM2CON0_ZLF_SIZE                                   0x1
#define _CM2CON0_ZLF_LENGTH                                 0x1
#define _CM2CON0_ZLF_MASK                                   0x8
#define _CM2CON0_POL_POSN                                   0x4
#define _CM2CON0_POL_POSITION                               0x4
#define _CM2CON0_POL_SIZE                                   0x1
#define _CM2CON0_POL_LENGTH                                 0x1
#define _CM2CON0_POL_MASK                                   0x10
#define _CM2CON0_OUT_POSN                                   0x6
#define _CM2CON0_OUT_POSITION                               0x6
#define _CM2CON0_OUT_SIZE                                   0x1
#define _CM2CON0_OUT_LENGTH                                 0x1
#define _CM2CON0_OUT_MASK                                   0x40
#define _CM2CON0_ON_POSN                                    0x7
#define _CM2CON0_ON_POSITION                                0x7
#define _CM2CON0_ON_SIZE                                    0x1
#define _CM2CON0_ON_LENGTH                                  0x1
#define _CM2CON0_ON_MASK                                    0x80
#define _CM2CON0_C2SYNC_POSN                                0x0
#define _CM2CON0_C2SYNC_POSITION                            0x0
#define _CM2CON0_C2SYNC_SIZE                                0x1
#define _CM2CON0_C2SYNC_LENGTH                              0x1
#define _CM2CON0_C2SYNC_MASK                                0x1
#define _CM2CON0_C2HYS_POSN                                 0x1
#define _CM2CON0_C2HYS_POSITION                             0x1
#define _CM2CON0_C2HYS_SIZE                                 0x1
#define _CM2CON0_C2HYS_LENGTH                               0x1
#define _CM2CON0_C2HYS_MASK                                 0x2
#define _CM2CON0_C2SP_POSN                                  0x2
#define _CM2CON0_C2SP_POSITION                              0x2
#define _CM2CON0_C2SP_SIZE                                  0x1
#define _CM2CON0_C2SP_LENGTH                                0x1
#define _CM2CON0_C2SP_MASK                                  0x4
#define _CM2CON0_C2ZLF_POSN                                 0x3
#define _CM2CON0_C2ZLF_POSITION                             0x3
#define _CM2CON0_C2ZLF_SIZE                                 0x1
#define _CM2CON0_C2ZLF_LENGTH                               0x1
#define _CM2CON0_C2ZLF_MASK                                 0x8
#define _CM2CON0_C2POL_POSN                                 0x4
#define _CM2CON0_C2POL_POSITION                             0x4
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x10
#define _CM2CON0_C2OUT_POSN                                 0x6
#define _CM2CON0_C2OUT_POSITION                             0x6
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x40
#define _CM2CON0_C2ON_POSN                                  0x7
#define _CM2CON0_C2ON_POSITION                              0x7
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x80

// Register: CM2CON1
#define CM2CON1 CM2CON1
extern volatile unsigned char           CM2CON1             __at(0x115);
#ifndef _LIB_BUILD
asm("CM2CON1 equ 0115h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C2INTN                 :1;
        unsigned C2INTP                 :1;
    };
} CM2CON1bits_t;
extern volatile CM2CON1bits_t CM2CON1bits __at(0x115);
// bitfield macros
#define _CM2CON1_INTN_POSN                                  0x0
#define _CM2CON1_INTN_POSITION                              0x0
#define _CM2CON1_INTN_SIZE                                  0x1
#define _CM2CON1_INTN_LENGTH                                0x1
#define _CM2CON1_INTN_MASK                                  0x1
#define _CM2CON1_INTP_POSN                                  0x1
#define _CM2CON1_INTP_POSITION                              0x1
#define _CM2CON1_INTP_SIZE                                  0x1
#define _CM2CON1_INTP_LENGTH                                0x1
#define _CM2CON1_INTP_MASK                                  0x2
#define _CM2CON1_C2INTN_POSN                                0x0
#define _CM2CON1_C2INTN_POSITION                            0x0
#define _CM2CON1_C2INTN_SIZE                                0x1
#define _CM2CON1_C2INTN_LENGTH                              0x1
#define _CM2CON1_C2INTN_MASK                                0x1
#define _CM2CON1_C2INTP_POSN                                0x1
#define _CM2CON1_C2INTP_POSITION                            0x1
#define _CM2CON1_C2INTP_SIZE                                0x1
#define _CM2CON1_C2INTP_LENGTH                              0x1
#define _CM2CON1_C2INTP_MASK                                0x2

// Register: CM2NSEL
#define CM2NSEL CM2NSEL
extern volatile unsigned char           CM2NSEL             __at(0x116);
#ifndef _LIB_BUILD
asm("CM2NSEL equ 0116h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :3;
    };
    struct {
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned C2NCH                  :3;
    };
    struct {
        unsigned C2NCH0                 :1;
        unsigned C2NCH1                 :1;
        unsigned C2NCH2                 :1;
    };
} CM2NSELbits_t;
extern volatile CM2NSELbits_t CM2NSELbits __at(0x116);
// bitfield macros
#define _CM2NSEL_NCH_POSN                                   0x0
#define _CM2NSEL_NCH_POSITION                               0x0
#define _CM2NSEL_NCH_SIZE                                   0x3
#define _CM2NSEL_NCH_LENGTH                                 0x3
#define _CM2NSEL_NCH_MASK                                   0x7
#define _CM2NSEL_NCH0_POSN                                  0x0
#define _CM2NSEL_NCH0_POSITION                              0x0
#define _CM2NSEL_NCH0_SIZE                                  0x1
#define _CM2NSEL_NCH0_LENGTH                                0x1
#define _CM2NSEL_NCH0_MASK                                  0x1
#define _CM2NSEL_NCH1_POSN                                  0x1
#define _CM2NSEL_NCH1_POSITION                              0x1
#define _CM2NSEL_NCH1_SIZE                                  0x1
#define _CM2NSEL_NCH1_LENGTH                                0x1
#define _CM2NSEL_NCH1_MASK                                  0x2
#define _CM2NSEL_NCH2_POSN                                  0x2
#define _CM2NSEL_NCH2_POSITION                              0x2
#define _CM2NSEL_NCH2_SIZE                                  0x1
#define _CM2NSEL_NCH2_LENGTH                                0x1
#define _CM2NSEL_NCH2_MASK                                  0x4
#define _CM2NSEL_C2NCH_POSN                                 0x0
#define _CM2NSEL_C2NCH_POSITION                             0x0
#define _CM2NSEL_C2NCH_SIZE                                 0x3
#define _CM2NSEL_C2NCH_LENGTH                               0x3
#define _CM2NSEL_C2NCH_MASK                                 0x7
#define _CM2NSEL_C2NCH0_POSN                                0x0
#define _CM2NSEL_C2NCH0_POSITION                            0x0
#define _CM2NSEL_C2NCH0_SIZE                                0x1
#define _CM2NSEL_C2NCH0_LENGTH                              0x1
#define _CM2NSEL_C2NCH0_MASK                                0x1
#define _CM2NSEL_C2NCH1_POSN                                0x1
#define _CM2NSEL_C2NCH1_POSITION                            0x1
#define _CM2NSEL_C2NCH1_SIZE                                0x1
#define _CM2NSEL_C2NCH1_LENGTH                              0x1
#define _CM2NSEL_C2NCH1_MASK                                0x2
#define _CM2NSEL_C2NCH2_POSN                                0x2
#define _CM2NSEL_C2NCH2_POSITION                            0x2
#define _CM2NSEL_C2NCH2_SIZE                                0x1
#define _CM2NSEL_C2NCH2_LENGTH                              0x1
#define _CM2NSEL_C2NCH2_MASK                                0x4

// Register: CM2PSEL
#define CM2PSEL CM2PSEL
extern volatile unsigned char           CM2PSEL             __at(0x117);
#ifndef _LIB_BUILD
asm("CM2PSEL equ 0117h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C2PCH                  :4;
    };
    struct {
        unsigned C2PCH0                 :1;
        unsigned C2PCH1                 :1;
        unsigned C2PCH2                 :1;
        unsigned C2PCH3                 :1;
    };
} CM2PSELbits_t;
extern volatile CM2PSELbits_t CM2PSELbits __at(0x117);
// bitfield macros
#define _CM2PSEL_PCH_POSN                                   0x0
#define _CM2PSEL_PCH_POSITION                               0x0
#define _CM2PSEL_PCH_SIZE                                   0x4
#define _CM2PSEL_PCH_LENGTH                                 0x4
#define _CM2PSEL_PCH_MASK                                   0xF
#define _CM2PSEL_PCH0_POSN                                  0x0
#define _CM2PSEL_PCH0_POSITION                              0x0
#define _CM2PSEL_PCH0_SIZE                                  0x1
#define _CM2PSEL_PCH0_LENGTH                                0x1
#define _CM2PSEL_PCH0_MASK                                  0x1
#define _CM2PSEL_PCH1_POSN                                  0x1
#define _CM2PSEL_PCH1_POSITION                              0x1
#define _CM2PSEL_PCH1_SIZE                                  0x1
#define _CM2PSEL_PCH1_LENGTH                                0x1
#define _CM2PSEL_PCH1_MASK                                  0x2
#define _CM2PSEL_PCH2_POSN                                  0x2
#define _CM2PSEL_PCH2_POSITION                              0x2
#define _CM2PSEL_PCH2_SIZE                                  0x1
#define _CM2PSEL_PCH2_LENGTH                                0x1
#define _CM2PSEL_PCH2_MASK                                  0x4
#define _CM2PSEL_PCH3_POSN                                  0x3
#define _CM2PSEL_PCH3_POSITION                              0x3
#define _CM2PSEL_PCH3_SIZE                                  0x1
#define _CM2PSEL_PCH3_LENGTH                                0x1
#define _CM2PSEL_PCH3_MASK                                  0x8
#define _CM2PSEL_C2PCH_POSN                                 0x0
#define _CM2PSEL_C2PCH_POSITION                             0x0
#define _CM2PSEL_C2PCH_SIZE                                 0x4
#define _CM2PSEL_C2PCH_LENGTH                               0x4
#define _CM2PSEL_C2PCH_MASK                                 0xF
#define _CM2PSEL_C2PCH0_POSN                                0x0
#define _CM2PSEL_C2PCH0_POSITION                            0x0
#define _CM2PSEL_C2PCH0_SIZE                                0x1
#define _CM2PSEL_C2PCH0_LENGTH                              0x1
#define _CM2PSEL_C2PCH0_MASK                                0x1
#define _CM2PSEL_C2PCH1_POSN                                0x1
#define _CM2PSEL_C2PCH1_POSITION                            0x1
#define _CM2PSEL_C2PCH1_SIZE                                0x1
#define _CM2PSEL_C2PCH1_LENGTH                              0x1
#define _CM2PSEL_C2PCH1_MASK                                0x2
#define _CM2PSEL_C2PCH2_POSN                                0x2
#define _CM2PSEL_C2PCH2_POSITION                            0x2
#define _CM2PSEL_C2PCH2_SIZE                                0x1
#define _CM2PSEL_C2PCH2_LENGTH                              0x1
#define _CM2PSEL_C2PCH2_MASK                                0x4
#define _CM2PSEL_C2PCH3_POSN                                0x3
#define _CM2PSEL_C2PCH3_POSITION                            0x3
#define _CM2PSEL_C2PCH3_SIZE                                0x1
#define _CM2PSEL_C2PCH3_LENGTH                              0x1
#define _CM2PSEL_C2PCH3_MASK                                0x8

// Register: CM3CON0
#define CM3CON0 CM3CON0
extern volatile unsigned char           CM3CON0             __at(0x118);
#ifndef _LIB_BUILD
asm("CM3CON0 equ 0118h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C3SYNC                 :1;
        unsigned C3HYS                  :1;
        unsigned C3SP                   :1;
        unsigned C3ZLF                  :1;
        unsigned C3POL                  :1;
        unsigned                        :1;
        unsigned C3OUT                  :1;
        unsigned C3ON                   :1;
    };
} CM3CON0bits_t;
extern volatile CM3CON0bits_t CM3CON0bits __at(0x118);
// bitfield macros
#define _CM3CON0_SYNC_POSN                                  0x0
#define _CM3CON0_SYNC_POSITION                              0x0
#define _CM3CON0_SYNC_SIZE                                  0x1
#define _CM3CON0_SYNC_LENGTH                                0x1
#define _CM3CON0_SYNC_MASK                                  0x1
#define _CM3CON0_HYS_POSN                                   0x1
#define _CM3CON0_HYS_POSITION                               0x1
#define _CM3CON0_HYS_SIZE                                   0x1
#define _CM3CON0_HYS_LENGTH                                 0x1
#define _CM3CON0_HYS_MASK                                   0x2
#define _CM3CON0_ZLF_POSN                                   0x3
#define _CM3CON0_ZLF_POSITION                               0x3
#define _CM3CON0_ZLF_SIZE                                   0x1
#define _CM3CON0_ZLF_LENGTH                                 0x1
#define _CM3CON0_ZLF_MASK                                   0x8
#define _CM3CON0_POL_POSN                                   0x4
#define _CM3CON0_POL_POSITION                               0x4
#define _CM3CON0_POL_SIZE                                   0x1
#define _CM3CON0_POL_LENGTH                                 0x1
#define _CM3CON0_POL_MASK                                   0x10
#define _CM3CON0_OUT_POSN                                   0x6
#define _CM3CON0_OUT_POSITION                               0x6
#define _CM3CON0_OUT_SIZE                                   0x1
#define _CM3CON0_OUT_LENGTH                                 0x1
#define _CM3CON0_OUT_MASK                                   0x40
#define _CM3CON0_ON_POSN                                    0x7
#define _CM3CON0_ON_POSITION                                0x7
#define _CM3CON0_ON_SIZE                                    0x1
#define _CM3CON0_ON_LENGTH                                  0x1
#define _CM3CON0_ON_MASK                                    0x80
#define _CM3CON0_C3SYNC_POSN                                0x0
#define _CM3CON0_C3SYNC_POSITION                            0x0
#define _CM3CON0_C3SYNC_SIZE                                0x1
#define _CM3CON0_C3SYNC_LENGTH                              0x1
#define _CM3CON0_C3SYNC_MASK                                0x1
#define _CM3CON0_C3HYS_POSN                                 0x1
#define _CM3CON0_C3HYS_POSITION                             0x1
#define _CM3CON0_C3HYS_SIZE                                 0x1
#define _CM3CON0_C3HYS_LENGTH                               0x1
#define _CM3CON0_C3HYS_MASK                                 0x2
#define _CM3CON0_C3SP_POSN                                  0x2
#define _CM3CON0_C3SP_POSITION                              0x2
#define _CM3CON0_C3SP_SIZE                                  0x1
#define _CM3CON0_C3SP_LENGTH                                0x1
#define _CM3CON0_C3SP_MASK                                  0x4
#define _CM3CON0_C3ZLF_POSN                                 0x3
#define _CM3CON0_C3ZLF_POSITION                             0x3
#define _CM3CON0_C3ZLF_SIZE                                 0x1
#define _CM3CON0_C3ZLF_LENGTH                               0x1
#define _CM3CON0_C3ZLF_MASK                                 0x8
#define _CM3CON0_C3POL_POSN                                 0x4
#define _CM3CON0_C3POL_POSITION                             0x4
#define _CM3CON0_C3POL_SIZE                                 0x1
#define _CM3CON0_C3POL_LENGTH                               0x1
#define _CM3CON0_C3POL_MASK                                 0x10
#define _CM3CON0_C3OUT_POSN                                 0x6
#define _CM3CON0_C3OUT_POSITION                             0x6
#define _CM3CON0_C3OUT_SIZE                                 0x1
#define _CM3CON0_C3OUT_LENGTH                               0x1
#define _CM3CON0_C3OUT_MASK                                 0x40
#define _CM3CON0_C3ON_POSN                                  0x7
#define _CM3CON0_C3ON_POSITION                              0x7
#define _CM3CON0_C3ON_SIZE                                  0x1
#define _CM3CON0_C3ON_LENGTH                                0x1
#define _CM3CON0_C3ON_MASK                                  0x80

// Register: CM3CON1
#define CM3CON1 CM3CON1
extern volatile unsigned char           CM3CON1             __at(0x119);
#ifndef _LIB_BUILD
asm("CM3CON1 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C3INTN                 :1;
        unsigned C3INTP                 :1;
    };
} CM3CON1bits_t;
extern volatile CM3CON1bits_t CM3CON1bits __at(0x119);
// bitfield macros
#define _CM3CON1_INTN_POSN                                  0x0
#define _CM3CON1_INTN_POSITION                              0x0
#define _CM3CON1_INTN_SIZE                                  0x1
#define _CM3CON1_INTN_LENGTH                                0x1
#define _CM3CON1_INTN_MASK                                  0x1
#define _CM3CON1_INTP_POSN                                  0x1
#define _CM3CON1_INTP_POSITION                              0x1
#define _CM3CON1_INTP_SIZE                                  0x1
#define _CM3CON1_INTP_LENGTH                                0x1
#define _CM3CON1_INTP_MASK                                  0x2
#define _CM3CON1_C3INTN_POSN                                0x0
#define _CM3CON1_C3INTN_POSITION                            0x0
#define _CM3CON1_C3INTN_SIZE                                0x1
#define _CM3CON1_C3INTN_LENGTH                              0x1
#define _CM3CON1_C3INTN_MASK                                0x1
#define _CM3CON1_C3INTP_POSN                                0x1
#define _CM3CON1_C3INTP_POSITION                            0x1
#define _CM3CON1_C3INTP_SIZE                                0x1
#define _CM3CON1_C3INTP_LENGTH                              0x1
#define _CM3CON1_C3INTP_MASK                                0x2

// Register: CM3NSEL
#define CM3NSEL CM3NSEL
extern volatile unsigned char           CM3NSEL             __at(0x11A);
#ifndef _LIB_BUILD
asm("CM3NSEL equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :3;
    };
    struct {
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned C3NCH                  :3;
    };
    struct {
        unsigned C3NCH0                 :1;
        unsigned C3NCH1                 :1;
        unsigned C3NCH2                 :1;
    };
} CM3NSELbits_t;
