MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1769/mcu.h
extern volatile MD2CARHbits_t MD2CARHbits __at(0x31F);
// bitfield macros
#define _MD2CARH_CH_POSN                                    0x0
#define _MD2CARH_CH_POSITION                                0x0
#define _MD2CARH_CH_SIZE                                    0x4
#define _MD2CARH_CH_LENGTH                                  0x4
#define _MD2CARH_CH_MASK                                    0xF
#define _MD2CARH_CH0_POSN                                   0x0
#define _MD2CARH_CH0_POSITION                               0x0
#define _MD2CARH_CH0_SIZE                                   0x1
#define _MD2CARH_CH0_LENGTH                                 0x1
#define _MD2CARH_CH0_MASK                                   0x1
#define _MD2CARH_CH1_POSN                                   0x1
#define _MD2CARH_CH1_POSITION                               0x1
#define _MD2CARH_CH1_SIZE                                   0x1
#define _MD2CARH_CH1_LENGTH                                 0x1
#define _MD2CARH_CH1_MASK                                   0x2
#define _MD2CARH_CH2_POSN                                   0x2
#define _MD2CARH_CH2_POSITION                               0x2
#define _MD2CARH_CH2_SIZE                                   0x1
#define _MD2CARH_CH2_LENGTH                                 0x1
#define _MD2CARH_CH2_MASK                                   0x4
#define _MD2CARH_CH3_POSN                                   0x3
#define _MD2CARH_CH3_POSITION                               0x3
#define _MD2CARH_CH3_SIZE                                   0x1
#define _MD2CARH_CH3_LENGTH                                 0x1
#define _MD2CARH_CH3_MASK                                   0x8
#define _MD2CARH_MD2CH_POSN                                 0x0
#define _MD2CARH_MD2CH_POSITION                             0x0
#define _MD2CARH_MD2CH_SIZE                                 0x4
#define _MD2CARH_MD2CH_LENGTH                               0x4
#define _MD2CARH_MD2CH_MASK                                 0xF
#define _MD2CARH_MD2CH0_POSN                                0x0
#define _MD2CARH_MD2CH0_POSITION                            0x0
#define _MD2CARH_MD2CH0_SIZE                                0x1
#define _MD2CARH_MD2CH0_LENGTH                              0x1
#define _MD2CARH_MD2CH0_MASK                                0x1
#define _MD2CARH_MD2CH1_POSN                                0x1
#define _MD2CARH_MD2CH1_POSITION                            0x1
#define _MD2CARH_MD2CH1_SIZE                                0x1
#define _MD2CARH_MD2CH1_LENGTH                              0x1
#define _MD2CARH_MD2CH1_MASK                                0x2
#define _MD2CARH_MD2CH2_POSN                                0x2
#define _MD2CARH_MD2CH2_POSITION                            0x2
#define _MD2CARH_MD2CH2_SIZE                                0x1
#define _MD2CARH_MD2CH2_LENGTH                              0x1
#define _MD2CARH_MD2CH2_MASK                                0x4
#define _MD2CARH_MD2CH3_POSN                                0x3
#define _MD2CARH_MD2CH3_POSITION                            0x3
#define _MD2CARH_MD2CH3_SIZE                                0x1
#define _MD2CARH_MD2CH3_LENGTH                              0x1
#define _MD2CARH_MD2CH3_MASK                                0x8

// Register: INLVLA
#define INLVLA INLVLA
extern volatile unsigned char           INLVLA              __at(0x38C);
#ifndef _LIB_BUILD
asm("INLVLA equ 038Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLA0                :1;
        unsigned INLVLA1                :1;
        unsigned INLVLA2                :1;
        unsigned INLVLA3                :1;
        unsigned INLVLA4                :1;
        unsigned INLVLA5                :1;
    };
} INLVLAbits_t;
extern volatile INLVLAbits_t INLVLAbits __at(0x38C);
// bitfield macros
#define _INLVLA_INLVLA0_POSN                                0x0
#define _INLVLA_INLVLA0_POSITION                            0x0
#define _INLVLA_INLVLA0_SIZE                                0x1
#define _INLVLA_INLVLA0_LENGTH                              0x1
#define _INLVLA_INLVLA0_MASK                                0x1
#define _INLVLA_INLVLA1_POSN                                0x1
#define _INLVLA_INLVLA1_POSITION                            0x1
#define _INLVLA_INLVLA1_SIZE                                0x1
#define _INLVLA_INLVLA1_LENGTH                              0x1
#define _INLVLA_INLVLA1_MASK                                0x2
#define _INLVLA_INLVLA2_POSN                                0x2
#define _INLVLA_INLVLA2_POSITION                            0x2
#define _INLVLA_INLVLA2_SIZE                                0x1
#define _INLVLA_INLVLA2_LENGTH                              0x1
#define _INLVLA_INLVLA2_MASK                                0x4
#define _INLVLA_INLVLA3_POSN                                0x3
#define _INLVLA_INLVLA3_POSITION                            0x3
#define _INLVLA_INLVLA3_SIZE                                0x1
#define _INLVLA_INLVLA3_LENGTH                              0x1
#define _INLVLA_INLVLA3_MASK                                0x8
#define _INLVLA_INLVLA4_POSN                                0x4
#define _INLVLA_INLVLA4_POSITION                            0x4
#define _INLVLA_INLVLA4_SIZE                                0x1
#define _INLVLA_INLVLA4_LENGTH                              0x1
#define _INLVLA_INLVLA4_MASK                                0x10
#define _INLVLA_INLVLA5_POSN                                0x5
#define _INLVLA_INLVLA5_POSITION                            0x5
#define _INLVLA_INLVLA5_SIZE                                0x1
#define _INLVLA_INLVLA5_LENGTH                              0x1
#define _INLVLA_INLVLA5_MASK                                0x20

// Register: INLVLB
#define INLVLB INLVLB
extern volatile unsigned char           INLVLB              __at(0x38D);
#ifndef _LIB_BUILD
asm("INLVLB equ 038Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned INLVLB4                :1;
        unsigned INLVLB5                :1;
        unsigned INLVLB6                :1;
        unsigned INLVLB7                :1;
    };
} INLVLBbits_t;
extern volatile INLVLBbits_t INLVLBbits __at(0x38D);
// bitfield macros
#define _INLVLB_INLVLB4_POSN                                0x4
#define _INLVLB_INLVLB4_POSITION                            0x4
#define _INLVLB_INLVLB4_SIZE                                0x1
#define _INLVLB_INLVLB4_LENGTH                              0x1
#define _INLVLB_INLVLB4_MASK                                0x10
#define _INLVLB_INLVLB5_POSN                                0x5
#define _INLVLB_INLVLB5_POSITION                            0x5
#define _INLVLB_INLVLB5_SIZE                                0x1
#define _INLVLB_INLVLB5_LENGTH                              0x1
#define _INLVLB_INLVLB5_MASK                                0x20
#define _INLVLB_INLVLB6_POSN                                0x6
#define _INLVLB_INLVLB6_POSITION                            0x6
#define _INLVLB_INLVLB6_SIZE                                0x1
#define _INLVLB_INLVLB6_LENGTH                              0x1
#define _INLVLB_INLVLB6_MASK                                0x40
#define _INLVLB_INLVLB7_POSN                                0x7
#define _INLVLB_INLVLB7_POSITION                            0x7
#define _INLVLB_INLVLB7_SIZE                                0x1
#define _INLVLB_INLVLB7_LENGTH                              0x1
#define _INLVLB_INLVLB7_MASK                                0x80

