MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1769/mcu.h
// Register: COG1RIS1
#define COG1RIS1 COG1RIS1
extern volatile unsigned char           COG1RIS1            __at(0x696);
#ifndef _LIB_BUILD
asm("COG1RIS1 equ 0696h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RIS8                   :1;
        unsigned RIS9                   :1;
        unsigned RIS10                  :1;
        unsigned RIS11                  :1;
        unsigned RIS12                  :1;
        unsigned RIS13                  :1;
        unsigned RIS14                  :1;
        unsigned RIS15                  :1;
    };
    struct {
        unsigned G1RIS8                 :1;
        unsigned G1RIS9                 :1;
        unsigned G1RIS10                :1;
        unsigned G1RIS11                :1;
        unsigned G1RIS12                :1;
        unsigned G1RIS13                :1;
        unsigned G1RIS14                :1;
        unsigned G1RIS15                :1;
    };
} COG1RIS1bits_t;
extern volatile COG1RIS1bits_t COG1RIS1bits __at(0x696);
// bitfield macros
#define _COG1RIS1_RIS8_POSN                                 0x0
#define _COG1RIS1_RIS8_POSITION                             0x0
#define _COG1RIS1_RIS8_SIZE                                 0x1
#define _COG1RIS1_RIS8_LENGTH                               0x1
#define _COG1RIS1_RIS8_MASK                                 0x1
#define _COG1RIS1_RIS9_POSN                                 0x1
#define _COG1RIS1_RIS9_POSITION                             0x1
#define _COG1RIS1_RIS9_SIZE                                 0x1
#define _COG1RIS1_RIS9_LENGTH                               0x1
#define _COG1RIS1_RIS9_MASK                                 0x2
#define _COG1RIS1_RIS10_POSN                                0x2
#define _COG1RIS1_RIS10_POSITION                            0x2
#define _COG1RIS1_RIS10_SIZE                                0x1
#define _COG1RIS1_RIS10_LENGTH                              0x1
#define _COG1RIS1_RIS10_MASK                                0x4
#define _COG1RIS1_RIS11_POSN                                0x3
#define _COG1RIS1_RIS11_POSITION                            0x3
#define _COG1RIS1_RIS11_SIZE                                0x1
#define _COG1RIS1_RIS11_LENGTH                              0x1
#define _COG1RIS1_RIS11_MASK                                0x8
#define _COG1RIS1_RIS12_POSN                                0x4
#define _COG1RIS1_RIS12_POSITION                            0x4
#define _COG1RIS1_RIS12_SIZE                                0x1
#define _COG1RIS1_RIS12_LENGTH                              0x1
#define _COG1RIS1_RIS12_MASK                                0x10
#define _COG1RIS1_RIS13_POSN                                0x5
#define _COG1RIS1_RIS13_POSITION                            0x5
#define _COG1RIS1_RIS13_SIZE                                0x1
#define _COG1RIS1_RIS13_LENGTH                              0x1
#define _COG1RIS1_RIS13_MASK                                0x20
#define _COG1RIS1_RIS14_POSN                                0x6
#define _COG1RIS1_RIS14_POSITION                            0x6
#define _COG1RIS1_RIS14_SIZE                                0x1
#define _COG1RIS1_RIS14_LENGTH                              0x1
#define _COG1RIS1_RIS14_MASK                                0x40
#define _COG1RIS1_RIS15_POSN                                0x7
#define _COG1RIS1_RIS15_POSITION                            0x7
#define _COG1RIS1_RIS15_SIZE                                0x1
#define _COG1RIS1_RIS15_LENGTH                              0x1
#define _COG1RIS1_RIS15_MASK                                0x80
#define _COG1RIS1_G1RIS8_POSN                               0x0
#define _COG1RIS1_G1RIS8_POSITION                           0x0
#define _COG1RIS1_G1RIS8_SIZE                               0x1
#define _COG1RIS1_G1RIS8_LENGTH                             0x1
#define _COG1RIS1_G1RIS8_MASK                               0x1
#define _COG1RIS1_G1RIS9_POSN                               0x1
#define _COG1RIS1_G1RIS9_POSITION                           0x1
#define _COG1RIS1_G1RIS9_SIZE                               0x1
#define _COG1RIS1_G1RIS9_LENGTH                             0x1
#define _COG1RIS1_G1RIS9_MASK                               0x2
#define _COG1RIS1_G1RIS10_POSN                              0x2
#define _COG1RIS1_G1RIS10_POSITION                          0x2
#define _COG1RIS1_G1RIS10_SIZE                              0x1
#define _COG1RIS1_G1RIS10_LENGTH                            0x1
#define _COG1RIS1_G1RIS10_MASK                              0x4
#define _COG1RIS1_G1RIS11_POSN                              0x3
#define _COG1RIS1_G1RIS11_POSITION                          0x3
#define _COG1RIS1_G1RIS11_SIZE                              0x1
#define _COG1RIS1_G1RIS11_LENGTH                            0x1
#define _COG1RIS1_G1RIS11_MASK                              0x8
#define _COG1RIS1_G1RIS12_POSN                              0x4
#define _COG1RIS1_G1RIS12_POSITION                          0x4
#define _COG1RIS1_G1RIS12_SIZE                              0x1
#define _COG1RIS1_G1RIS12_LENGTH                            0x1
#define _COG1RIS1_G1RIS12_MASK                              0x10
#define _COG1RIS1_G1RIS13_POSN                              0x5
#define _COG1RIS1_G1RIS13_POSITION                          0x5
#define _COG1RIS1_G1RIS13_SIZE                              0x1
#define _COG1RIS1_G1RIS13_LENGTH                            0x1
#define _COG1RIS1_G1RIS13_MASK                              0x20
#define _COG1RIS1_G1RIS14_POSN                              0x6
#define _COG1RIS1_G1RIS14_POSITION                          0x6
#define _COG1RIS1_G1RIS14_SIZE                              0x1
#define _COG1RIS1_G1RIS14_LENGTH                            0x1
#define _COG1RIS1_G1RIS14_MASK                              0x40
#define _COG1RIS1_G1RIS15_POSN                              0x7
#define _COG1RIS1_G1RIS15_POSITION                          0x7
#define _COG1RIS1_G1RIS15_SIZE                              0x1
#define _COG1RIS1_G1RIS15_LENGTH                            0x1
#define _COG1RIS1_G1RIS15_MASK                              0x80

// Register: COG1RSIM0
#define COG1RSIM0 COG1RSIM0
extern volatile unsigned char           COG1RSIM0           __at(0x697);
#ifndef _LIB_BUILD
asm("COG1RSIM0 equ 0697h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSIM0                  :1;
        unsigned RSIM1                  :1;
        unsigned RSIM2                  :1;
        unsigned RSIM3                  :1;
        unsigned RSIM4                  :1;
        unsigned RSIM5                  :1;
        unsigned RSIM6                  :1;
        unsigned RSIM7                  :1;
    };
    struct {
        unsigned G1RSIM0                :1;
        unsigned G1RSIM1                :1;
        unsigned G1RSIM2                :1;
        unsigned G1RSIM3                :1;
        unsigned G1RSIM4                :1;
        unsigned G1RSIM5                :1;
        unsigned G1RSIM6                :1;
        unsigned G1RSIM7                :1;
    };
} COG1RSIM0bits_t;
extern volatile COG1RSIM0bits_t COG1RSIM0bits __at(0x697);
// bitfield macros
#define _COG1RSIM0_RSIM0_POSN                               0x0
#define _COG1RSIM0_RSIM0_POSITION                           0x0
#define _COG1RSIM0_RSIM0_SIZE                               0x1
#define _COG1RSIM0_RSIM0_LENGTH                             0x1
#define _COG1RSIM0_RSIM0_MASK                               0x1
#define _COG1RSIM0_RSIM1_POSN                               0x1
#define _COG1RSIM0_RSIM1_POSITION                           0x1
#define _COG1RSIM0_RSIM1_SIZE                               0x1
#define _COG1RSIM0_RSIM1_LENGTH                             0x1
#define _COG1RSIM0_RSIM1_MASK                               0x2
#define _COG1RSIM0_RSIM2_POSN                               0x2
#define _COG1RSIM0_RSIM2_POSITION                           0x2
#define _COG1RSIM0_RSIM2_SIZE                               0x1
#define _COG1RSIM0_RSIM2_LENGTH                             0x1
#define _COG1RSIM0_RSIM2_MASK                               0x4
#define _COG1RSIM0_RSIM3_POSN                               0x3
#define _COG1RSIM0_RSIM3_POSITION                           0x3
#define _COG1RSIM0_RSIM3_SIZE                               0x1
#define _COG1RSIM0_RSIM3_LENGTH                             0x1
#define _COG1RSIM0_RSIM3_MASK                               0x8
#define _COG1RSIM0_RSIM4_POSN                               0x4
#define _COG1RSIM0_RSIM4_POSITION                           0x4
#define _COG1RSIM0_RSIM4_SIZE                               0x1
#define _COG1RSIM0_RSIM4_LENGTH                             0x1
#define _COG1RSIM0_RSIM4_MASK                               0x10
#define _COG1RSIM0_RSIM5_POSN                               0x5
#define _COG1RSIM0_RSIM5_POSITION                           0x5
#define _COG1RSIM0_RSIM5_SIZE                               0x1
#define _COG1RSIM0_RSIM5_LENGTH                             0x1
#define _COG1RSIM0_RSIM5_MASK                               0x20
#define _COG1RSIM0_RSIM6_POSN                               0x6
#define _COG1RSIM0_RSIM6_POSITION                           0x6
#define _COG1RSIM0_RSIM6_SIZE                               0x1
#define _COG1RSIM0_RSIM6_LENGTH                             0x1
#define _COG1RSIM0_RSIM6_MASK                               0x40
#define _COG1RSIM0_RSIM7_POSN                               0x7
#define _COG1RSIM0_RSIM7_POSITION                           0x7
#define _COG1RSIM0_RSIM7_SIZE                               0x1
#define _COG1RSIM0_RSIM7_LENGTH                             0x1
#define _COG1RSIM0_RSIM7_MASK                               0x80
#define _COG1RSIM0_G1RSIM0_POSN                             0x0
#define _COG1RSIM0_G1RSIM0_POSITION                         0x0
#define _COG1RSIM0_G1RSIM0_SIZE                             0x1
#define _COG1RSIM0_G1RSIM0_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM0_MASK                             0x1
#define _COG1RSIM0_G1RSIM1_POSN                             0x1
#define _COG1RSIM0_G1RSIM1_POSITION                         0x1
#define _COG1RSIM0_G1RSIM1_SIZE                             0x1
#define _COG1RSIM0_G1RSIM1_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM1_MASK                             0x2
#define _COG1RSIM0_G1RSIM2_POSN                             0x2
#define _COG1RSIM0_G1RSIM2_POSITION                         0x2
#define _COG1RSIM0_G1RSIM2_SIZE                             0x1
#define _COG1RSIM0_G1RSIM2_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM2_MASK                             0x4
#define _COG1RSIM0_G1RSIM3_POSN                             0x3
#define _COG1RSIM0_G1RSIM3_POSITION                         0x3
#define _COG1RSIM0_G1RSIM3_SIZE                             0x1
#define _COG1RSIM0_G1RSIM3_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM3_MASK                             0x8
#define _COG1RSIM0_G1RSIM4_POSN                             0x4
#define _COG1RSIM0_G1RSIM4_POSITION                         0x4
#define _COG1RSIM0_G1RSIM4_SIZE                             0x1
#define _COG1RSIM0_G1RSIM4_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM4_MASK                             0x10
#define _COG1RSIM0_G1RSIM5_POSN                             0x5
#define _COG1RSIM0_G1RSIM5_POSITION                         0x5
#define _COG1RSIM0_G1RSIM5_SIZE                             0x1
#define _COG1RSIM0_G1RSIM5_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM5_MASK                             0x20
#define _COG1RSIM0_G1RSIM6_POSN                             0x6
#define _COG1RSIM0_G1RSIM6_POSITION                         0x6
#define _COG1RSIM0_G1RSIM6_SIZE                             0x1
#define _COG1RSIM0_G1RSIM6_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM6_MASK                             0x40
#define _COG1RSIM0_G1RSIM7_POSN                             0x7
#define _COG1RSIM0_G1RSIM7_POSITION                         0x7
#define _COG1RSIM0_G1RSIM7_SIZE                             0x1
#define _COG1RSIM0_G1RSIM7_LENGTH                           0x1
#define _COG1RSIM0_G1RSIM7_MASK                             0x80

// Register: COG1RSIM1
#define COG1RSIM1 COG1RSIM1
extern volatile unsigned char           COG1RSIM1           __at(0x698);
#ifndef _LIB_BUILD
asm("COG1RSIM1 equ 0698h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSIM8                  :1;
        unsigned RSIM9                  :1;
        unsigned RSIM10                 :1;
        unsigned RSIM11                 :1;
        unsigned RSIM12                 :1;
        unsigned RSIM13                 :1;
        unsigned RSIM14                 :1;
        unsigned RSIM15                 :1;
    };
    struct {
        unsigned G1RSIM8                :1;
        unsigned G1RSIM9                :1;
        unsigned G1RSIM10               :1;
        unsigned G1RSIM11               :1;
        unsigned G1RSIM12               :1;
        unsigned G1RSIM13               :1;
        unsigned G1RSIM14               :1;
        unsigned G1RSIM15               :1;
    };
} COG1RSIM1bits_t;
extern volatile COG1RSIM1bits_t COG1RSIM1bits __at(0x698);
// bitfield macros
#define _COG1RSIM1_RSIM8_POSN                               0x0
#define _COG1RSIM1_RSIM8_POSITION                           0x0
#define _COG1RSIM1_RSIM8_SIZE                               0x1
#define _COG1RSIM1_RSIM8_LENGTH                             0x1
#define _COG1RSIM1_RSIM8_MASK                               0x1
#define _COG1RSIM1_RSIM9_POSN                               0x1
#define _COG1RSIM1_RSIM9_POSITION                           0x1
#define _COG1RSIM1_RSIM9_SIZE                               0x1
#define _COG1RSIM1_RSIM9_LENGTH                             0x1
#define _COG1RSIM1_RSIM9_MASK                               0x2
#define _COG1RSIM1_RSIM10_POSN                              0x2
#define _COG1RSIM1_RSIM10_POSITION                          0x2
#define _COG1RSIM1_RSIM10_SIZE                              0x1
#define _COG1RSIM1_RSIM10_LENGTH                            0x1
#define _COG1RSIM1_RSIM10_MASK                              0x4
#define _COG1RSIM1_RSIM11_POSN                              0x3
#define _COG1RSIM1_RSIM11_POSITION                          0x3
#define _COG1RSIM1_RSIM11_SIZE                              0x1
#define _COG1RSIM1_RSIM11_LENGTH                            0x1
#define _COG1RSIM1_RSIM11_MASK                              0x8
#define _COG1RSIM1_RSIM12_POSN                              0x4
#define _COG1RSIM1_RSIM12_POSITION                          0x4
#define _COG1RSIM1_RSIM12_SIZE                              0x1
#define _COG1RSIM1_RSIM12_LENGTH                            0x1
#define _COG1RSIM1_RSIM12_MASK                              0x10
#define _COG1RSIM1_RSIM13_POSN                              0x5
#define _COG1RSIM1_RSIM13_POSITION                          0x5
#define _COG1RSIM1_RSIM13_SIZE                              0x1
#define _COG1RSIM1_RSIM13_LENGTH                            0x1
#define _COG1RSIM1_RSIM13_MASK                              0x20
#define _COG1RSIM1_RSIM14_POSN                              0x6
#define _COG1RSIM1_RSIM14_POSITION                          0x6
#define _COG1RSIM1_RSIM14_SIZE                              0x1
#define _COG1RSIM1_RSIM14_LENGTH                            0x1
#define _COG1RSIM1_RSIM14_MASK                              0x40
#define _COG1RSIM1_RSIM15_POSN                              0x7
#define _COG1RSIM1_RSIM15_POSITION                          0x7
#define _COG1RSIM1_RSIM15_SIZE                              0x1
#define _COG1RSIM1_RSIM15_LENGTH                            0x1
#define _COG1RSIM1_RSIM15_MASK                              0x80
#define _COG1RSIM1_G1RSIM8_POSN                             0x0
#define _COG1RSIM1_G1RSIM8_POSITION                         0x0
#define _COG1RSIM1_G1RSIM8_SIZE                             0x1
#define _COG1RSIM1_G1RSIM8_LENGTH                           0x1
#define _COG1RSIM1_G1RSIM8_MASK                             0x1
#define _COG1RSIM1_G1RSIM9_POSN                             0x1
#define _COG1RSIM1_G1RSIM9_POSITION                         0x1
#define _COG1RSIM1_G1RSIM9_SIZE                             0x1
#define _COG1RSIM1_G1RSIM9_LENGTH                           0x1
#define _COG1RSIM1_G1RSIM9_MASK                             0x2
#define _COG1RSIM1_G1RSIM10_POSN                            0x2
#define _COG1RSIM1_G1RSIM10_POSITION                        0x2
#define _COG1RSIM1_G1RSIM10_SIZE                            0x1
#define _COG1RSIM1_G1RSIM10_LENGTH                          0x1
#define _COG1RSIM1_G1RSIM10_MASK                            0x4
#define _COG1RSIM1_G1RSIM11_POSN                            0x3
#define _COG1RSIM1_G1RSIM11_POSITION                        0x3
#define _COG1RSIM1_G1RSIM11_SIZE                            0x1
#define _COG1RSIM1_G1RSIM11_LENGTH                          0x1
#define _COG1RSIM1_G1RSIM11_MASK                            0x8
#define _COG1RSIM1_G1RSIM12_POSN                            0x4
#define _COG1RSIM1_G1RSIM12_POSITION                        0x4
#define _COG1RSIM1_G1RSIM12_SIZE                            0x1
#define _COG1RSIM1_G1RSIM12_LENGTH                          0x1
#define _COG1RSIM1_G1RSIM12_MASK                            0x10
#define _COG1RSIM1_G1RSIM13_POSN                            0x5
#define _COG1RSIM1_G1RSIM13_POSITION                        0x5
#define _COG1RSIM1_G1RSIM13_SIZE                            0x1
#define _COG1RSIM1_G1RSIM13_LENGTH                          0x1
#define _COG1RSIM1_G1RSIM13_MASK                            0x20
#define _COG1RSIM1_G1RSIM14_POSN                            0x6
#define _COG1RSIM1_G1RSIM14_POSITION                        0x6
#define _COG1RSIM1_G1RSIM14_SIZE                            0x1
#define _COG1RSIM1_G1RSIM14_LENGTH                          0x1
#define _COG1RSIM1_G1RSIM14_MASK                            0x40
#define _COG1RSIM1_G1RSIM15_POSN                            0x7
#define _COG1RSIM1_G1RSIM15_POSITION                        0x7
#define _COG1RSIM1_G1RSIM15_SIZE                            0x1
#define _COG1RSIM1_G1RSIM15_LENGTH                          0x1
#define _COG1RSIM1_G1RSIM15_MASK                            0x80

// Register: COG1FIS0
#define COG1FIS0 COG1FIS0
extern volatile unsigned char           COG1FIS0            __at(0x699);
#ifndef _LIB_BUILD
asm("COG1FIS0 equ 0699h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIS0                   :1;
        unsigned FIS1                   :1;
        unsigned FIS2                   :1;
        unsigned FIS3                   :1;
        unsigned FIS4                   :1;
        unsigned FIS5                   :1;
        unsigned FIS6                   :1;
        unsigned FIS7                   :1;
    };
    struct {
        unsigned G1FIS0                 :1;
        unsigned G1FIS1                 :1;
        unsigned G1FIS2                 :1;
        unsigned G1FIS3                 :1;
        unsigned G1FIS4                 :1;
        unsigned G1FIS5                 :1;
        unsigned G1FIS6                 :1;
        unsigned G1FIS7                 :1;
    };
} COG1FIS0bits_t;
