MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1769/mcu.h
extern volatile __bit                   C4NCH0              __at(0x8F0);	// @ (0x11E * 8 + 0)
#define                                 C4NCH0_bit          _BIT_ACCESS(CM4NSEL,0)
// CM4NSEL<C4NCH1>
extern volatile __bit                   C4NCH1              __at(0x8F1);	// @ (0x11E * 8 + 1)
#define                                 C4NCH1_bit          _BIT_ACCESS(CM4NSEL,1)
// CM4NSEL<C4NCH2>
extern volatile __bit                   C4NCH2              __at(0x8F2);	// @ (0x11E * 8 + 2)
#define                                 C4NCH2_bit          _BIT_ACCESS(CM4NSEL,2)
// CM4CON0<C4ON>
extern volatile __bit                   C4ON                __at(0x8E7);	// @ (0x11C * 8 + 7)
#define                                 C4ON_bit            _BIT_ACCESS(CM4CON0,7)
// CM4CON0<C4OUT>
extern volatile __bit                   C4OUT               __at(0x8E6);	// @ (0x11C * 8 + 6)
#define                                 C4OUT_bit           _BIT_ACCESS(CM4CON0,6)
// CM4PSEL<C4PCH0>
extern volatile __bit                   C4PCH0              __at(0x8F8);	// @ (0x11F * 8 + 0)
#define                                 C4PCH0_bit          _BIT_ACCESS(CM4PSEL,0)
// CM4PSEL<C4PCH1>
extern volatile __bit                   C4PCH1              __at(0x8F9);	// @ (0x11F * 8 + 1)
#define                                 C4PCH1_bit          _BIT_ACCESS(CM4PSEL,1)
// CM4PSEL<C4PCH2>
extern volatile __bit                   C4PCH2              __at(0x8FA);	// @ (0x11F * 8 + 2)
#define                                 C4PCH2_bit          _BIT_ACCESS(CM4PSEL,2)
// CM4PSEL<C4PCH3>
extern volatile __bit                   C4PCH3              __at(0x8FB);	// @ (0x11F * 8 + 3)
#define                                 C4PCH3_bit          _BIT_ACCESS(CM4PSEL,3)
// CM4CON0<C4POL>
extern volatile __bit                   C4POL               __at(0x8E4);	// @ (0x11C * 8 + 4)
#define                                 C4POL_bit           _BIT_ACCESS(CM4CON0,4)
// CM4CON0<C4SP>
extern volatile __bit                   C4SP                __at(0x8E2);	// @ (0x11C * 8 + 2)
#define                                 C4SP_bit            _BIT_ACCESS(CM4CON0,2)
// CM4CON0<C4SYNC>
extern volatile __bit                   C4SYNC              __at(0x8E0);	// @ (0x11C * 8 + 0)
#define                                 C4SYNC_bit          _BIT_ACCESS(CM4CON0,0)
// CM4CON0<C4ZLF>
extern volatile __bit                   C4ZLF               __at(0x8E3);	// @ (0x11C * 8 + 3)
#define                                 C4ZLF_bit           _BIT_ACCESS(CM4CON0,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x14D5);	// @ (0x29A * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// PIE1<CCPIE>
extern volatile __bit                   CCPIE               __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCPIE_bit           _BIT_ACCESS(PIE1,2)
// PIR1<CCPIF>
extern volatile __bit                   CCPIF               __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCPIF_bit           _BIT_ACCESS(PIR1,2)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// PIE3<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR3,0)
// PIE3<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR3,1)
// PIE3<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR3,2)
// PIR3<COG1IF>
extern volatile __bit                   COG1IF              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 COG1IF_bit          _BIT_ACCESS(PIR3,5)
// PIE3<COG2IE>
extern volatile __bit                   COG2IE              __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 COG2IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<COG2IF>
extern volatile __bit                   COG2IF              __at(0x9B);	// @ (0x13 * 8 + 3)
#define                                 COG2IF_bit          _BIT_ACCESS(PIR3,3)
// PIE3<COGIE>
extern volatile __bit                   COGIE               __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 COGIE_bit           _BIT_ACCESS(PIE3,5)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1FM>
extern volatile __bit                   DAC1FM              __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 DAC1FM_bit          _BIT_ACCESS(DAC1CON0,6)
// DACLD<DAC1LD>
extern volatile __bit                   DAC1LD              __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 DAC1LD_bit          _BIT_ACCESS(DACLD,0)
// DAC1CON0<DAC1NSS0>
extern volatile __bit                   DAC1NSS0            __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 DAC1NSS0_bit        _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1REFL<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1R10>
extern volatile __bit                   DAC1R10             __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC1R10_bit         _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1R11>
extern volatile __bit                   DAC1R11             __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC1R11_bit         _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1R12>
extern volatile __bit                   DAC1R12             __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC1R12_bit         _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1R13>
extern volatile __bit                   DAC1R13             __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC1R13_bit         _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1R14>
extern volatile __bit                   DAC1R14             __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC1R14_bit         _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1R15>
extern volatile __bit                   DAC1R15             __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC1R15_bit         _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1R8>
extern volatile __bit                   DAC1R8              __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC1R8_bit          _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1R9>
extern volatile __bit                   DAC1R9              __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC1R9_bit          _BIT_ACCESS(DAC1REFH,1)
// DAC1REFL<DAC1REF0>
extern volatile __bit                   DAC1REF0            __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC1REF0_bit        _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1REF1>
extern volatile __bit                   DAC1REF1            __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC1REF1_bit        _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1REF10>
extern volatile __bit                   DAC1REF10           __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC1REF10_bit       _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1REF11>
extern volatile __bit                   DAC1REF11           __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC1REF11_bit       _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1REF12>
extern volatile __bit                   DAC1REF12           __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC1REF12_bit       _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1REF13>
extern volatile __bit                   DAC1REF13           __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC1REF13_bit       _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1REF14>
extern volatile __bit                   DAC1REF14           __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC1REF14_bit       _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1REF15>
extern volatile __bit                   DAC1REF15           __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC1REF15_bit       _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1REF2>
extern volatile __bit                   DAC1REF2            __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC1REF2_bit        _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1REF3>
extern volatile __bit                   DAC1REF3            __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC1REF3_bit        _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1REF4>
extern volatile __bit                   DAC1REF4            __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC1REF4_bit        _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1REF5>
extern volatile __bit                   DAC1REF5            __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC1REF5_bit        _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1REF6>
extern volatile __bit                   DAC1REF6            __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC1REF6_bit        _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1REF7>
extern volatile __bit                   DAC1REF7            __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC1REF7_bit        _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1REF8>
extern volatile __bit                   DAC1REF8            __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC1REF8_bit        _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1REF9>
extern volatile __bit                   DAC1REF9            __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC1REF9_bit        _BIT_ACCESS(DAC1REFH,1)
// DAC2CON0<DAC2EN>
extern volatile __bit                   DAC2EN              __at(0x2CA7);	// @ (0x594 * 8 + 7)
#define                                 DAC2EN_bit          _BIT_ACCESS(DAC2CON0,7)
// DAC2CON0<DAC2FM>
extern volatile __bit                   DAC2FM              __at(0x2CA6);	// @ (0x594 * 8 + 6)
#define                                 DAC2FM_bit          _BIT_ACCESS(DAC2CON0,6)
// DACLD<DAC2LD>
extern volatile __bit                   DAC2LD              __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 DAC2LD_bit          _BIT_ACCESS(DACLD,1)
// DAC2CON0<DAC2NSS0>
extern volatile __bit                   DAC2NSS0            __at(0x2CA0);	// @ (0x594 * 8 + 0)
#define                                 DAC2NSS0_bit        _BIT_ACCESS(DAC2CON0,0)
// DAC2CON0<DAC2OE1>
extern volatile __bit                   DAC2OE1             __at(0x2CA5);	// @ (0x594 * 8 + 5)
#define                                 DAC2OE1_bit         _BIT_ACCESS(DAC2CON0,5)
// DAC2CON0<DAC2PSS0>
extern volatile __bit                   DAC2PSS0            __at(0x2CA2);	// @ (0x594 * 8 + 2)
#define                                 DAC2PSS0_bit        _BIT_ACCESS(DAC2CON0,2)
// DAC2CON0<DAC2PSS1>
extern volatile __bit                   DAC2PSS1            __at(0x2CA3);	// @ (0x594 * 8 + 3)
#define                                 DAC2PSS1_bit        _BIT_ACCESS(DAC2CON0,3)
// DAC2REFL<DAC2R0>
extern volatile __bit                   DAC2R0              __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 DAC2R0_bit          _BIT_ACCESS(DAC2REFL,0)
// DAC2REFL<DAC2R1>
extern volatile __bit                   DAC2R1              __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 DAC2R1_bit          _BIT_ACCESS(DAC2REFL,1)
// DAC2REFH<DAC2R10>
extern volatile __bit                   DAC2R10             __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 DAC2R10_bit         _BIT_ACCESS(DAC2REFH,2)
// DAC2REFH<DAC2R11>
extern volatile __bit                   DAC2R11             __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 DAC2R11_bit         _BIT_ACCESS(DAC2REFH,3)
// DAC2REFH<DAC2R12>
extern volatile __bit                   DAC2R12             __at(0x2CB4);	// @ (0x596 * 8 + 4)
#define                                 DAC2R12_bit         _BIT_ACCESS(DAC2REFH,4)
// DAC2REFH<DAC2R13>
extern volatile __bit                   DAC2R13             __at(0x2CB5);	// @ (0x596 * 8 + 5)
#define                                 DAC2R13_bit         _BIT_ACCESS(DAC2REFH,5)
// DAC2REFH<DAC2R14>
extern volatile __bit                   DAC2R14             __at(0x2CB6);	// @ (0x596 * 8 + 6)
#define                                 DAC2R14_bit         _BIT_ACCESS(DAC2REFH,6)
// DAC2REFH<DAC2R15>
extern volatile __bit                   DAC2R15             __at(0x2CB7);	// @ (0x596 * 8 + 7)
#define                                 DAC2R15_bit         _BIT_ACCESS(DAC2REFH,7)
// DAC2REFL<DAC2R2>
extern volatile __bit                   DAC2R2              __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 DAC2R2_bit          _BIT_ACCESS(DAC2REFL,2)
// DAC2REFL<DAC2R3>
extern volatile __bit                   DAC2R3              __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 DAC2R3_bit          _BIT_ACCESS(DAC2REFL,3)
// DAC2REFL<DAC2R4>
extern volatile __bit                   DAC2R4              __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 DAC2R4_bit          _BIT_ACCESS(DAC2REFL,4)
// DAC2REFL<DAC2R5>
extern volatile __bit                   DAC2R5              __at(0x2CAD);	// @ (0x595 * 8 + 5)
#define                                 DAC2R5_bit          _BIT_ACCESS(DAC2REFL,5)
// DAC2REFL<DAC2R6>
extern volatile __bit                   DAC2R6              __at(0x2CAE);	// @ (0x595 * 8 + 6)
#define                                 DAC2R6_bit          _BIT_ACCESS(DAC2REFL,6)
// DAC2REFL<DAC2R7>
extern volatile __bit                   DAC2R7              __at(0x2CAF);	// @ (0x595 * 8 + 7)
#define                                 DAC2R7_bit          _BIT_ACCESS(DAC2REFL,7)
// DAC2REFH<DAC2R8>
extern volatile __bit                   DAC2R8              __at(0x2CB0);	// @ (0x596 * 8 + 0)
