MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1769/mcu.h
extern volatile __bit                   PWM5PRH1            __at(0x6CB1);	// @ (0xD96 * 8 + 1)
#define                                 PWM5PRH1_bit        _BIT_ACCESS(PWM5PRH,1)
// PWM5PRH<PWM5PRH2>
extern volatile __bit                   PWM5PRH2            __at(0x6CB2);	// @ (0xD96 * 8 + 2)
#define                                 PWM5PRH2_bit        _BIT_ACCESS(PWM5PRH,2)
// PWM5PRH<PWM5PRH3>
extern volatile __bit                   PWM5PRH3            __at(0x6CB3);	// @ (0xD96 * 8 + 3)
#define                                 PWM5PRH3_bit        _BIT_ACCESS(PWM5PRH,3)
// PWM5PRH<PWM5PRH4>
extern volatile __bit                   PWM5PRH4            __at(0x6CB4);	// @ (0xD96 * 8 + 4)
#define                                 PWM5PRH4_bit        _BIT_ACCESS(PWM5PRH,4)
// PWM5PRH<PWM5PRH5>
extern volatile __bit                   PWM5PRH5            __at(0x6CB5);	// @ (0xD96 * 8 + 5)
#define                                 PWM5PRH5_bit        _BIT_ACCESS(PWM5PRH,5)
// PWM5PRH<PWM5PRH6>
extern volatile __bit                   PWM5PRH6            __at(0x6CB6);	// @ (0xD96 * 8 + 6)
#define                                 PWM5PRH6_bit        _BIT_ACCESS(PWM5PRH,6)
// PWM5PRH<PWM5PRH7>
extern volatile __bit                   PWM5PRH7            __at(0x6CB7);	// @ (0xD96 * 8 + 7)
#define                                 PWM5PRH7_bit        _BIT_ACCESS(PWM5PRH,7)
// PWM5INTE<PWM5PRIE>
extern volatile __bit                   PWM5PRIE            __at(0x6CE0);	// @ (0xD9C * 8 + 0)
#define                                 PWM5PRIE_bit        _BIT_ACCESS(PWM5INTE,0)
// PWM5INTF<PWM5PRIF>
extern volatile __bit                   PWM5PRIF            __at(0x6CE8);	// @ (0xD9D * 8 + 0)
#define                                 PWM5PRIF_bit        _BIT_ACCESS(PWM5INTF,0)
// PWM5PRL<PWM5PRL0>
extern volatile __bit                   PWM5PRL0            __at(0x6CA8);	// @ (0xD95 * 8 + 0)
#define                                 PWM5PRL0_bit        _BIT_ACCESS(PWM5PRL,0)
// PWM5PRL<PWM5PRL1>
extern volatile __bit                   PWM5PRL1            __at(0x6CA9);	// @ (0xD95 * 8 + 1)
#define                                 PWM5PRL1_bit        _BIT_ACCESS(PWM5PRL,1)
// PWM5PRL<PWM5PRL2>
extern volatile __bit                   PWM5PRL2            __at(0x6CAA);	// @ (0xD95 * 8 + 2)
#define                                 PWM5PRL2_bit        _BIT_ACCESS(PWM5PRL,2)
// PWM5PRL<PWM5PRL3>
extern volatile __bit                   PWM5PRL3            __at(0x6CAB);	// @ (0xD95 * 8 + 3)
#define                                 PWM5PRL3_bit        _BIT_ACCESS(PWM5PRL,3)
// PWM5PRL<PWM5PRL4>
extern volatile __bit                   PWM5PRL4            __at(0x6CAC);	// @ (0xD95 * 8 + 4)
#define                                 PWM5PRL4_bit        _BIT_ACCESS(PWM5PRL,4)
// PWM5PRL<PWM5PRL5>
extern volatile __bit                   PWM5PRL5            __at(0x6CAD);	// @ (0xD95 * 8 + 5)
#define                                 PWM5PRL5_bit        _BIT_ACCESS(PWM5PRL,5)
// PWM5PRL<PWM5PRL6>
extern volatile __bit                   PWM5PRL6            __at(0x6CAE);	// @ (0xD95 * 8 + 6)
#define                                 PWM5PRL6_bit        _BIT_ACCESS(PWM5PRL,6)
// PWM5PRL<PWM5PRL7>
extern volatile __bit                   PWM5PRL7            __at(0x6CAF);	// @ (0xD95 * 8 + 7)
#define                                 PWM5PRL7_bit        _BIT_ACCESS(PWM5PRL,7)
// PWM5CLKCON<PWM5PS0>
extern volatile __bit                   PWM5PS0             __at(0x6CF4);	// @ (0xD9E * 8 + 4)
#define                                 PWM5PS0_bit         _BIT_ACCESS(PWM5CLKCON,4)
// PWM5CLKCON<PWM5PS1>
extern volatile __bit                   PWM5PS1             __at(0x6CF5);	// @ (0xD9E * 8 + 5)
#define                                 PWM5PS1_bit         _BIT_ACCESS(PWM5CLKCON,5)
// PWM5CLKCON<PWM5PS2>
extern volatile __bit                   PWM5PS2             __at(0x6CF6);	// @ (0xD9E * 8 + 6)
#define                                 PWM5PS2_bit         _BIT_ACCESS(PWM5CLKCON,6)
// PWM5TMRH<PWM5TMRH0>
extern volatile __bit                   PWM5TMRH0           __at(0x6CD0);	// @ (0xD9A * 8 + 0)
#define                                 PWM5TMRH0_bit       _BIT_ACCESS(PWM5TMRH,0)
// PWM5TMRH<PWM5TMRH1>
extern volatile __bit                   PWM5TMRH1           __at(0x6CD1);	// @ (0xD9A * 8 + 1)
#define                                 PWM5TMRH1_bit       _BIT_ACCESS(PWM5TMRH,1)
// PWM5TMRH<PWM5TMRH2>
extern volatile __bit                   PWM5TMRH2           __at(0x6CD2);	// @ (0xD9A * 8 + 2)
#define                                 PWM5TMRH2_bit       _BIT_ACCESS(PWM5TMRH,2)
// PWM5TMRH<PWM5TMRH3>
extern volatile __bit                   PWM5TMRH3           __at(0x6CD3);	// @ (0xD9A * 8 + 3)
#define                                 PWM5TMRH3_bit       _BIT_ACCESS(PWM5TMRH,3)
// PWM5TMRH<PWM5TMRH4>
extern volatile __bit                   PWM5TMRH4           __at(0x6CD4);	// @ (0xD9A * 8 + 4)
#define                                 PWM5TMRH4_bit       _BIT_ACCESS(PWM5TMRH,4)
// PWM5TMRH<PWM5TMRH5>
extern volatile __bit                   PWM5TMRH5           __at(0x6CD5);	// @ (0xD9A * 8 + 5)
#define                                 PWM5TMRH5_bit       _BIT_ACCESS(PWM5TMRH,5)
// PWM5TMRH<PWM5TMRH6>
extern volatile __bit                   PWM5TMRH6           __at(0x6CD6);	// @ (0xD9A * 8 + 6)
#define                                 PWM5TMRH6_bit       _BIT_ACCESS(PWM5TMRH,6)
// PWM5TMRH<PWM5TMRH7>
extern volatile __bit                   PWM5TMRH7           __at(0x6CD7);	// @ (0xD9A * 8 + 7)
#define                                 PWM5TMRH7_bit       _BIT_ACCESS(PWM5TMRH,7)
// PWM5TMRL<PWM5TMRL0>
extern volatile __bit                   PWM5TMRL0           __at(0x6CC8);	// @ (0xD99 * 8 + 0)
#define                                 PWM5TMRL0_bit       _BIT_ACCESS(PWM5TMRL,0)
// PWM5TMRL<PWM5TMRL1>
extern volatile __bit                   PWM5TMRL1           __at(0x6CC9);	// @ (0xD99 * 8 + 1)
#define                                 PWM5TMRL1_bit       _BIT_ACCESS(PWM5TMRL,1)
// PWM5TMRL<PWM5TMRL2>
extern volatile __bit                   PWM5TMRL2           __at(0x6CCA);	// @ (0xD99 * 8 + 2)
#define                                 PWM5TMRL2_bit       _BIT_ACCESS(PWM5TMRL,2)
// PWM5TMRL<PWM5TMRL3>
extern volatile __bit                   PWM5TMRL3           __at(0x6CCB);	// @ (0xD99 * 8 + 3)
#define                                 PWM5TMRL3_bit       _BIT_ACCESS(PWM5TMRL,3)
// PWM5TMRL<PWM5TMRL4>
extern volatile __bit                   PWM5TMRL4           __at(0x6CCC);	// @ (0xD99 * 8 + 4)
#define                                 PWM5TMRL4_bit       _BIT_ACCESS(PWM5TMRL,4)
// PWM5TMRL<PWM5TMRL5>
extern volatile __bit                   PWM5TMRL5           __at(0x6CCD);	// @ (0xD99 * 8 + 5)
#define                                 PWM5TMRL5_bit       _BIT_ACCESS(PWM5TMRL,5)
// PWM5TMRL<PWM5TMRL6>
extern volatile __bit                   PWM5TMRL6           __at(0x6CCE);	// @ (0xD99 * 8 + 6)
#define                                 PWM5TMRL6_bit       _BIT_ACCESS(PWM5TMRL,6)
// PWM5TMRL<PWM5TMRL7>
extern volatile __bit                   PWM5TMRL7           __at(0x6CCF);	// @ (0xD99 * 8 + 7)
#define                                 PWM5TMRL7_bit       _BIT_ACCESS(PWM5TMRL,7)
// PWM6CLKCON<PWM6CS0>
extern volatile __bit                   PWM6CS0             __at(0x6D70);	// @ (0xDAE * 8 + 0)
#define                                 PWM6CS0_bit         _BIT_ACCESS(PWM6CLKCON,0)
// PWM6CLKCON<PWM6CS1>
extern volatile __bit                   PWM6CS1             __at(0x6D71);	// @ (0xDAE * 8 + 1)
#define                                 PWM6CS1_bit         _BIT_ACCESS(PWM6CLKCON,1)
// PWM6CLKCON<PWM6CS2>
extern volatile __bit                   PWM6CS2             __at(0x6D72);	// @ (0xDAE * 8 + 2)
#define                                 PWM6CS2_bit         _BIT_ACCESS(PWM6CLKCON,2)
// PWM6DCH<PWM6DCH0>
extern volatile __bit                   PWM6DCH0            __at(0x6D20);	// @ (0xDA4 * 8 + 0)
#define                                 PWM6DCH0_bit        _BIT_ACCESS(PWM6DCH,0)
// PWM6DCH<PWM6DCH1>
extern volatile __bit                   PWM6DCH1            __at(0x6D21);	// @ (0xDA4 * 8 + 1)
#define                                 PWM6DCH1_bit        _BIT_ACCESS(PWM6DCH,1)
// PWM6DCH<PWM6DCH2>
extern volatile __bit                   PWM6DCH2            __at(0x6D22);	// @ (0xDA4 * 8 + 2)
#define                                 PWM6DCH2_bit        _BIT_ACCESS(PWM6DCH,2)
// PWM6DCH<PWM6DCH3>
extern volatile __bit                   PWM6DCH3            __at(0x6D23);	// @ (0xDA4 * 8 + 3)
#define                                 PWM6DCH3_bit        _BIT_ACCESS(PWM6DCH,3)
// PWM6DCH<PWM6DCH4>
extern volatile __bit                   PWM6DCH4            __at(0x6D24);	// @ (0xDA4 * 8 + 4)
#define                                 PWM6DCH4_bit        _BIT_ACCESS(PWM6DCH,4)
// PWM6DCH<PWM6DCH5>
extern volatile __bit                   PWM6DCH5            __at(0x6D25);	// @ (0xDA4 * 8 + 5)
#define                                 PWM6DCH5_bit        _BIT_ACCESS(PWM6DCH,5)
// PWM6DCH<PWM6DCH6>
extern volatile __bit                   PWM6DCH6            __at(0x6D26);	// @ (0xDA4 * 8 + 6)
#define                                 PWM6DCH6_bit        _BIT_ACCESS(PWM6DCH,6)
// PWM6DCH<PWM6DCH7>
extern volatile __bit                   PWM6DCH7            __at(0x6D27);	// @ (0xDA4 * 8 + 7)
#define                                 PWM6DCH7_bit        _BIT_ACCESS(PWM6DCH,7)
// PWM6INTE<PWM6DCIE>
extern volatile __bit                   PWM6DCIE            __at(0x6D61);	// @ (0xDAC * 8 + 1)
#define                                 PWM6DCIE_bit        _BIT_ACCESS(PWM6INTE,1)
// PWM6INTF<PWM6DCIF>
extern volatile __bit                   PWM6DCIF            __at(0x6D69);	// @ (0xDAD * 8 + 1)
#define                                 PWM6DCIF_bit        _BIT_ACCESS(PWM6INTF,1)
// PWM6DCL<PWM6DCL0>
extern volatile __bit                   PWM6DCL0            __at(0x6D18);	// @ (0xDA3 * 8 + 0)
#define                                 PWM6DCL0_bit        _BIT_ACCESS(PWM6DCL,0)
// PWM6DCL<PWM6DCL1>
extern volatile __bit                   PWM6DCL1            __at(0x6D19);	// @ (0xDA3 * 8 + 1)
#define                                 PWM6DCL1_bit        _BIT_ACCESS(PWM6DCL,1)
// PWM6DCL<PWM6DCL2>
extern volatile __bit                   PWM6DCL2            __at(0x6D1A);	// @ (0xDA3 * 8 + 2)
#define                                 PWM6DCL2_bit        _BIT_ACCESS(PWM6DCL,2)
// PWM6DCL<PWM6DCL3>
extern volatile __bit                   PWM6DCL3            __at(0x6D1B);	// @ (0xDA3 * 8 + 3)
#define                                 PWM6DCL3_bit        _BIT_ACCESS(PWM6DCL,3)
// PWM6DCL<PWM6DCL4>
extern volatile __bit                   PWM6DCL4            __at(0x6D1C);	// @ (0xDA3 * 8 + 4)
#define                                 PWM6DCL4_bit        _BIT_ACCESS(PWM6DCL,4)
// PWM6DCL<PWM6DCL5>
extern volatile __bit                   PWM6DCL5            __at(0x6D1D);	// @ (0xDA3 * 8 + 5)
#define                                 PWM6DCL5_bit        _BIT_ACCESS(PWM6DCL,5)
// PWM6DCL<PWM6DCL6>
extern volatile __bit                   PWM6DCL6            __at(0x6D1E);	// @ (0xDA3 * 8 + 6)
#define                                 PWM6DCL6_bit        _BIT_ACCESS(PWM6DCL,6)
// PWM6DCL<PWM6DCL7>
extern volatile __bit                   PWM6DCL7            __at(0x6D1F);	// @ (0xDA3 * 8 + 7)
#define                                 PWM6DCL7_bit        _BIT_ACCESS(PWM6DCL,7)
// PWM6CON<PWM6EN>
extern volatile __bit                   PWM6EN              __at(0x6D5F);	// @ (0xDAB * 8 + 7)
#define                                 PWM6EN_bit          _BIT_ACCESS(PWM6CON,7)
// PIE3<PWM6IE>
extern volatile __bit                   PWM6IE              __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 PWM6IE_bit          _BIT_ACCESS(PIE3,7)
// PIR3<PWM6IF>
extern volatile __bit                   PWM6IF              __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 PWM6IF_bit          _BIT_ACCESS(PIR3,7)
// PWM6LDCON<PWM6LD>
extern volatile __bit                   PWM6LD              __at(0x6D7F);	// @ (0xDAF * 8 + 7)
#define                                 PWM6LD_bit          _BIT_ACCESS(PWM6LDCON,7)
// PWM6LDCON<PWM6LDM>
extern volatile __bit                   PWM6LDM             __at(0x6D7E);	// @ (0xDAF * 8 + 6)
#define                                 PWM6LDM_bit         _BIT_ACCESS(PWM6LDCON,6)
// PWM6LDCON<PWM6LDS0>
extern volatile __bit                   PWM6LDS0            __at(0x6D78);	// @ (0xDAF * 8 + 0)
#define                                 PWM6LDS0_bit        _BIT_ACCESS(PWM6LDCON,0)
// PWM6CON<PWM6MODE0>
extern volatile __bit                   PWM6MODE0           __at(0x6D5A);	// @ (0xDAB * 8 + 2)
#define                                 PWM6MODE0_bit       _BIT_ACCESS(PWM6CON,2)
// PWM6CON<PWM6MODE1>
extern volatile __bit                   PWM6MODE1           __at(0x6D5B);	// @ (0xDAB * 8 + 3)
#define                                 PWM6MODE1_bit       _BIT_ACCESS(PWM6CON,3)
// PWM6OFH<PWM6OFH0>
extern volatile __bit                   PWM6OFH0            __at(0x6D40);	// @ (0xDA8 * 8 + 0)
#define                                 PWM6OFH0_bit        _BIT_ACCESS(PWM6OFH,0)
// PWM6OFH<PWM6OFH1>
extern volatile __bit                   PWM6OFH1            __at(0x6D41);	// @ (0xDA8 * 8 + 1)
#define                                 PWM6OFH1_bit        _BIT_ACCESS(PWM6OFH,1)
// PWM6OFH<PWM6OFH2>
extern volatile __bit                   PWM6OFH2            __at(0x6D42);	// @ (0xDA8 * 8 + 2)
#define                                 PWM6OFH2_bit        _BIT_ACCESS(PWM6OFH,2)
// PWM6OFH<PWM6OFH3>
extern volatile __bit                   PWM6OFH3            __at(0x6D43);	// @ (0xDA8 * 8 + 3)
#define                                 PWM6OFH3_bit        _BIT_ACCESS(PWM6OFH,3)
// PWM6OFH<PWM6OFH4>
extern volatile __bit                   PWM6OFH4            __at(0x6D44);	// @ (0xDA8 * 8 + 4)
#define                                 PWM6OFH4_bit        _BIT_ACCESS(PWM6OFH,4)
// PWM6OFH<PWM6OFH5>
extern volatile __bit                   PWM6OFH5            __at(0x6D45);	// @ (0xDA8 * 8 + 5)
#define                                 PWM6OFH5_bit        _BIT_ACCESS(PWM6OFH,5)
// PWM6OFH<PWM6OFH6>
extern volatile __bit                   PWM6OFH6            __at(0x6D46);	// @ (0xDA8 * 8 + 6)
#define                                 PWM6OFH6_bit        _BIT_ACCESS(PWM6OFH,6)
// PWM6OFH<PWM6OFH7>
extern volatile __bit                   PWM6OFH7            __at(0x6D47);	// @ (0xDA8 * 8 + 7)
#define                                 PWM6OFH7_bit        _BIT_ACCESS(PWM6OFH,7)
// PWM6INTE<PWM6OFIE>
extern volatile __bit                   PWM6OFIE            __at(0x6D63);	// @ (0xDAC * 8 + 3)
#define                                 PWM6OFIE_bit        _BIT_ACCESS(PWM6INTE,3)
// PWM6INTF<PWM6OFIF>
extern volatile __bit                   PWM6OFIF            __at(0x6D6B);	// @ (0xDAD * 8 + 3)
#define                                 PWM6OFIF_bit        _BIT_ACCESS(PWM6INTF,3)
// PWM6OFL<PWM6OFL0>
extern volatile __bit                   PWM6OFL0            __at(0x6D38);	// @ (0xDA7 * 8 + 0)
#define                                 PWM6OFL0_bit        _BIT_ACCESS(PWM6OFL,0)
// PWM6OFL<PWM6OFL1>
extern volatile __bit                   PWM6OFL1            __at(0x6D39);	// @ (0xDA7 * 8 + 1)
#define                                 PWM6OFL1_bit        _BIT_ACCESS(PWM6OFL,1)
// PWM6OFL<PWM6OFL2>
extern volatile __bit                   PWM6OFL2            __at(0x6D3A);	// @ (0xDA7 * 8 + 2)
#define                                 PWM6OFL2_bit        _BIT_ACCESS(PWM6OFL,2)
// PWM6OFL<PWM6OFL3>
extern volatile __bit                   PWM6OFL3            __at(0x6D3B);	// @ (0xDA7 * 8 + 3)
#define                                 PWM6OFL3_bit        _BIT_ACCESS(PWM6OFL,3)
// PWM6OFL<PWM6OFL4>
extern volatile __bit                   PWM6OFL4            __at(0x6D3C);	// @ (0xDA7 * 8 + 4)
#define                                 PWM6OFL4_bit        _BIT_ACCESS(PWM6OFL,4)
// PWM6OFL<PWM6OFL5>
extern volatile __bit                   PWM6OFL5            __at(0x6D3D);	// @ (0xDA7 * 8 + 5)
#define                                 PWM6OFL5_bit        _BIT_ACCESS(PWM6OFL,5)
// PWM6OFL<PWM6OFL6>
extern volatile __bit                   PWM6OFL6            __at(0x6D3E);	// @ (0xDA7 * 8 + 6)
#define                                 PWM6OFL6_bit        _BIT_ACCESS(PWM6OFL,6)
// PWM6OFL<PWM6OFL7>
extern volatile __bit                   PWM6OFL7            __at(0x6D3F);	// @ (0xDA7 * 8 + 7)
#define                                 PWM6OFL7_bit        _BIT_ACCESS(PWM6OFL,7)
// PWM6OFCON<PWM6OFM0>
extern volatile __bit                   PWM6OFM0            __at(0x6D85);	// @ (0xDB0 * 8 + 5)
#define                                 PWM6OFM0_bit        _BIT_ACCESS(PWM6OFCON,5)
// PWM6OFCON<PWM6OFM1>
extern volatile __bit                   PWM6OFM1            __at(0x6D86);	// @ (0xDB0 * 8 + 6)
#define                                 PWM6OFM1_bit        _BIT_ACCESS(PWM6OFCON,6)
// PWM6OFCON<PWM6OFMC>
extern volatile __bit                   PWM6OFMC            __at(0x6D84);	// @ (0xDB0 * 8 + 4)
#define                                 PWM6OFMC_bit        _BIT_ACCESS(PWM6OFCON,4)
// PWM6OFCON<PWM6OFS0>
extern volatile __bit                   PWM6OFS0            __at(0x6D80);	// @ (0xDB0 * 8 + 0)
#define                                 PWM6OFS0_bit        _BIT_ACCESS(PWM6OFCON,0)
// PWM6CON<PWM6OUT>
extern volatile __bit                   PWM6OUT             __at(0x6D5D);	// @ (0xDAB * 8 + 5)
#define                                 PWM6OUT_bit         _BIT_ACCESS(PWM6CON,5)
// PWM6PHH<PWM6PHH0>
extern volatile __bit                   PWM6PHH0            __at(0x6D10);	// @ (0xDA2 * 8 + 0)
#define                                 PWM6PHH0_bit        _BIT_ACCESS(PWM6PHH,0)
// PWM6PHH<PWM6PHH1>
extern volatile __bit                   PWM6PHH1            __at(0x6D11);	// @ (0xDA2 * 8 + 1)
#define                                 PWM6PHH1_bit        _BIT_ACCESS(PWM6PHH,1)
// PWM6PHH<PWM6PHH2>
extern volatile __bit                   PWM6PHH2            __at(0x6D12);	// @ (0xDA2 * 8 + 2)
#define                                 PWM6PHH2_bit        _BIT_ACCESS(PWM6PHH,2)
// PWM6PHH<PWM6PHH3>
extern volatile __bit                   PWM6PHH3            __at(0x6D13);	// @ (0xDA2 * 8 + 3)
#define                                 PWM6PHH3_bit        _BIT_ACCESS(PWM6PHH,3)
// PWM6PHH<PWM6PHH4>
extern volatile __bit                   PWM6PHH4            __at(0x6D14);	// @ (0xDA2 * 8 + 4)
#define                                 PWM6PHH4_bit        _BIT_ACCESS(PWM6PHH,4)
// PWM6PHH<PWM6PHH5>
extern volatile __bit                   PWM6PHH5            __at(0x6D15);	// @ (0xDA2 * 8 + 5)
#define                                 PWM6PHH5_bit        _BIT_ACCESS(PWM6PHH,5)
// PWM6PHH<PWM6PHH6>
extern volatile __bit                   PWM6PHH6            __at(0x6D16);	// @ (0xDA2 * 8 + 6)
#define                                 PWM6PHH6_bit        _BIT_ACCESS(PWM6PHH,6)
// PWM6PHH<PWM6PHH7>
extern volatile __bit                   PWM6PHH7            __at(0x6D17);	// @ (0xDA2 * 8 + 7)
#define                                 PWM6PHH7_bit        _BIT_ACCESS(PWM6PHH,7)
// PWM6INTE<PWM6PHIE>
extern volatile __bit                   PWM6PHIE            __at(0x6D62);	// @ (0xDAC * 8 + 2)
#define                                 PWM6PHIE_bit        _BIT_ACCESS(PWM6INTE,2)
// PWM6INTF<PWM6PHIF>
extern volatile __bit                   PWM6PHIF            __at(0x6D6A);	// @ (0xDAD * 8 + 2)
#define                                 PWM6PHIF_bit        _BIT_ACCESS(PWM6INTF,2)
// PWM6PHL<PWM6PHL0>
extern volatile __bit                   PWM6PHL0            __at(0x6D08);	// @ (0xDA1 * 8 + 0)
#define                                 PWM6PHL0_bit        _BIT_ACCESS(PWM6PHL,0)
// PWM6PHL<PWM6PHL1>
extern volatile __bit                   PWM6PHL1            __at(0x6D09);	// @ (0xDA1 * 8 + 1)
#define                                 PWM6PHL1_bit        _BIT_ACCESS(PWM6PHL,1)
// PWM6PHL<PWM6PHL2>
extern volatile __bit                   PWM6PHL2            __at(0x6D0A);	// @ (0xDA1 * 8 + 2)
#define                                 PWM6PHL2_bit        _BIT_ACCESS(PWM6PHL,2)
// PWM6PHL<PWM6PHL3>
extern volatile __bit                   PWM6PHL3            __at(0x6D0B);	// @ (0xDA1 * 8 + 3)
#define                                 PWM6PHL3_bit        _BIT_ACCESS(PWM6PHL,3)
// PWM6PHL<PWM6PHL4>
extern volatile __bit                   PWM6PHL4            __at(0x6D0C);	// @ (0xDA1 * 8 + 4)
#define                                 PWM6PHL4_bit        _BIT_ACCESS(PWM6PHL,4)
// PWM6PHL<PWM6PHL5>
extern volatile __bit                   PWM6PHL5            __at(0x6D0D);	// @ (0xDA1 * 8 + 5)
#define                                 PWM6PHL5_bit        _BIT_ACCESS(PWM6PHL,5)
// PWM6PHL<PWM6PHL6>
extern volatile __bit                   PWM6PHL6            __at(0x6D0E);	// @ (0xDA1 * 8 + 6)
#define                                 PWM6PHL6_bit        _BIT_ACCESS(PWM6PHL,6)
// PWM6PHL<PWM6PHL7>
extern volatile __bit                   PWM6PHL7            __at(0x6D0F);	// @ (0xDA1 * 8 + 7)
#define                                 PWM6PHL7_bit        _BIT_ACCESS(PWM6PHL,7)
// PWM6CON<PWM6POL>
extern volatile __bit                   PWM6POL             __at(0x6D5C);	// @ (0xDAB * 8 + 4)
#define                                 PWM6POL_bit         _BIT_ACCESS(PWM6CON,4)
// PWM6PRH<PWM6PRH0>
extern volatile __bit                   PWM6PRH0            __at(0x6D30);	// @ (0xDA6 * 8 + 0)
#define                                 PWM6PRH0_bit        _BIT_ACCESS(PWM6PRH,0)
// PWM6PRH<PWM6PRH1>
extern volatile __bit                   PWM6PRH1            __at(0x6D31);	// @ (0xDA6 * 8 + 1)
#define                                 PWM6PRH1_bit        _BIT_ACCESS(PWM6PRH,1)
// PWM6PRH<PWM6PRH2>
extern volatile __bit                   PWM6PRH2            __at(0x6D32);	// @ (0xDA6 * 8 + 2)
#define                                 PWM6PRH2_bit        _BIT_ACCESS(PWM6PRH,2)
// PWM6PRH<PWM6PRH3>
extern volatile __bit                   PWM6PRH3            __at(0x6D33);	// @ (0xDA6 * 8 + 3)
#define                                 PWM6PRH3_bit        _BIT_ACCESS(PWM6PRH,3)
// PWM6PRH<PWM6PRH4>
extern volatile __bit                   PWM6PRH4            __at(0x6D34);	// @ (0xDA6 * 8 + 4)
#define                                 PWM6PRH4_bit        _BIT_ACCESS(PWM6PRH,4)
// PWM6PRH<PWM6PRH5>
extern volatile __bit                   PWM6PRH5            __at(0x6D35);	// @ (0xDA6 * 8 + 5)
#define                                 PWM6PRH5_bit        _BIT_ACCESS(PWM6PRH,5)
// PWM6PRH<PWM6PRH6>
extern volatile __bit                   PWM6PRH6            __at(0x6D36);	// @ (0xDA6 * 8 + 6)
#define                                 PWM6PRH6_bit        _BIT_ACCESS(PWM6PRH,6)
// PWM6PRH<PWM6PRH7>
extern volatile __bit                   PWM6PRH7            __at(0x6D37);	// @ (0xDA6 * 8 + 7)
#define                                 PWM6PRH7_bit        _BIT_ACCESS(PWM6PRH,7)
// PWM6INTE<PWM6PRIE>
extern volatile __bit                   PWM6PRIE            __at(0x6D60);	// @ (0xDAC * 8 + 0)
#define                                 PWM6PRIE_bit        _BIT_ACCESS(PWM6INTE,0)
// PWM6INTF<PWM6PRIF>
extern volatile __bit                   PWM6PRIF            __at(0x6D68);	// @ (0xDAD * 8 + 0)
#define                                 PWM6PRIF_bit        _BIT_ACCESS(PWM6INTF,0)
// PWM6PRL<PWM6PRL0>
extern volatile __bit                   PWM6PRL0            __at(0x6D28);	// @ (0xDA5 * 8 + 0)
#define                                 PWM6PRL0_bit        _BIT_ACCESS(PWM6PRL,0)
// PWM6PRL<PWM6PRL1>
extern volatile __bit                   PWM6PRL1            __at(0x6D29);	// @ (0xDA5 * 8 + 1)
#define                                 PWM6PRL1_bit        _BIT_ACCESS(PWM6PRL,1)
// PWM6PRL<PWM6PRL2>
extern volatile __bit                   PWM6PRL2            __at(0x6D2A);	// @ (0xDA5 * 8 + 2)
#define                                 PWM6PRL2_bit        _BIT_ACCESS(PWM6PRL,2)
// PWM6PRL<PWM6PRL3>
